УТ/src/InformationRegisters/CRM_ДанныеОбратнойСвязи/CRM_ДанныеОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДанныеОбратнойСвязи</name>
  <resources>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </resources>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_ОбъектыАРМ_Обращения/CRM_ОбъектыАРМ_Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыАРМ_Обращения</name>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДатыЗаполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СмещениеДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Звонок_Состояние</name>
    <type>
      <types>EnumRef.сфпСостоянияЗвонков</types>
    </type>
  </resources>
  <resources>
    <name>Письмо_Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.CRM_Обращения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>СконвертированВОбъект</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанСКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанала</name>
    <type>
      <types>EnumRef.CRM_ВидыКаналовПоступленияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.CRM_ПричиныОтклоненияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтмеченВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_СостоянияЛидов/CRM_СостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новое</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Повторный</name>
      <description>Повторное</description>
    </items>
    <items>
      <name>ПовторныйОбработанный</name>
      <description>Повторное (обработанное)</description>
    </items>
    <items>
      <name>Потерян</name>
      <description>Потеряно</description>
    </items>
    <items>
      <name>Сконвертирован</name>
      <description>Сконвертировано</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_РаботаСОбращениями/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает интервал времени строкой.
//
// Параметры:
//	ВремяОкончания - Дата - Время окончания.
//	ВремяНачала	   - Дата - Время начала.
//
// Возвращаемое значение:
//	Строка - интервал времени строкой.
//
Функция ИнтервалВремениСтрокой(ВремяОкончания, ВремяНачала = Неопределено) Экспорт
	
	Если ВремяНачала = Неопределено Тогда
		ВремяНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗнакИнтервала = "";
	ВеличинаИнтервала = ВремяОкончания - ВремяНачала;
	Если ВеличинаИнтервала < 0 Тогда
		ВеличинаИнтервала = -ВеличинаИнтервала;
		ЗнакИнтервала = "-";
	КонецЕсли;
	
	ВеличинаИнтервалаВДнях = Цел(ВеличинаИнтервала / 60 / 60 / 24);
	ОстатокЧасовМинут = ВеличинаИнтервала - ВеличинаИнтервалаВДнях * 60 * 60 * 24;
	ВеличинаИнтервалаВЧасах = Цел(ОстатокЧасовМинут / 60 / 60);
	ОстатокМинут = ОстатокЧасовМинут - ВеличинаИнтервалаВЧасах * 60 * 60;
	ВеличинаИнтервалаВМинутах = Цел(ОстатокМинут / 60);
	
	ОписаниеИнтервала = ЗнакИнтервала +
		?(ВеличинаИнтервалаВДнях = 0, "", Строка(ВеличинаИнтервалаВДнях) + НСтр("ru = 'д'; en = 'd'") + " ") +
		?(ВеличинаИнтервалаВЧасах = 0, "", Строка(ВеличинаИнтервалаВЧасах) + НСтр("ru = 'ч'; en = 'h'") + " ") +
		?(ВеличинаИнтервалаВМинутах = 0, "", Строка(ВеличинаИнтервалаВМинутах) + НСтр("ru = 'мин'; en = 'min'"));
	
	Возврат ОписаниеИнтервала;
	
КонецФункции

// Возвращает ключ обратной связи по обращению.
//
// Параметры:
//	Обращение - ДокументСсылка.CRM_Интерес - Обращение для установки обратной связи.
//
// Возвращаемое значение:
//	Строка - ключ обратной связи по обращению.
//
Функция КлючОбратнойСвязиПоОбращению(Обращение) Экспорт
	
	Ключ = СтрЗаменить(Обращение.УникальныйИдентификатор(), "-", "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеОбратнойСвязи.Ключ КАК Ключ
	|ИЗ
	|	РегистрСведений.CRM_ДанныеОбратнойСвязи КАК ДанныеОбратнойСвязи
	|ГДЕ
	|	ДанныеОбратнойСвязи.Ключ = &Ключ");
	
	Запрос.Параметры.Вставить("Ключ", Ключ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.CRM_ДанныеОбратнойСвязи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ключ = Ключ;
		МенеджерЗаписи.Обращение = Обращение;
		МенеджерЗаписи.ДатаОценки = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ключ;
	
КонецФункции

// Возвращает адрес страницы обратной связи.
//
// Возвращаемое значение:
//	Строка - адрес страницы обратной связи.
//
Функция АдресСтраницыОбратнойСвязи() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	АдресПубликации = Константы.CRM_АдресСервисаОбратнойСвязи.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликации);
	
	АдресОбратнойСвязи =  СтруктураАдреса.Схема + "://" +
		СтруктураАдреса.Хост +
		?(ЗначениеЗаполнено(СтруктураАдреса.Порт), ":" + ?(ТипЗНЧ(СтруктураАдреса.Порт) = Тип("Число"),
			 Формат(СтруктураАдреса.Порт, "ЧГ="), СтруктураАдреса.Порт), "") + "/" +
		СтруктураАдреса.ПутьНаСервере;
		
	Возврат АдресОбратнойСвязи;
	
КонецФункции

// Процедура предназначена для регистрации потерянных обращений.
//
Процедура CRM_РегистрацияПотерянныхОбращений() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.CRM_РегистрацияПотерянныхОбращений);

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ИсточникиПолученияЛидов.Ссылка КАК Канал,
	                      |	CRM_ИсточникиПолученияЛидов.CRM_СрокЖизниОбращения КАК CRM_СрокЖизниОбращения
	                      |ПОМЕСТИТЬ СрокиЖизни
	                      |ИЗ
	                      |	Справочник.CRM_ИсточникиПолученияЛидов КАК CRM_ИсточникиПолученияЛидов
	                      |ГДЕ
	                      |	CRM_ИсточникиПолученияЛидов.CRM_ИсточникЛидов
	                      |	И CRM_ИсточникиПолученияЛидов.CRM_СрокЖизниОбращения > 0
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	CRM_УчетныеЗаписиМессенджеров.Ссылка,
	                      |	CRM_УчетныеЗаписиМессенджеров.CRM_СрокЖизниОбращения
	                      |ИЗ
	                      |	Справочник.CRM_УчетныеЗаписиМессенджеров КАК CRM_УчетныеЗаписиМессенджеров
	                      |ГДЕ
	                      |	CRM_УчетныеЗаписиМессенджеров.CRM_ИсточникЛидов
	                      |	И CRM_УчетныеЗаписиМессенджеров.CRM_СрокЖизниОбращения > 0
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	УчетныеЗаписиЭлектроннойПочты.Ссылка,
	                      |	УчетныеЗаписиЭлектроннойПочты.CRM_СрокЖизниОбращения
	                      |ИЗ
	                      |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	                      |ГДЕ
	                      |	УчетныеЗаписиЭлектроннойПочты.CRM_ИсточникЛидов
	                      |	И УчетныеЗаписиЭлектроннойПочты.CRM_СрокЖизниОбращения > 0
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	НЕОПРЕДЕЛЕНО,
	                      |	CRM_СрокЖизниЗвонков.Значение
	                      |ИЗ
	                      |	Константа.CRM_СрокЖизниЗвонков КАК CRM_СрокЖизниЗвонков
	                      |ГДЕ
	                      |	CRM_СрокЖизниЗвонков.Значение > 0
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	CRM_ОбъектыАРМ_Обращения.Объект КАК Объект
	                      |ИЗ
	                      |	РегистрСведений.CRM_ОбъектыАРМ_Обращения КАК CRM_ОбъектыАРМ_Обращения
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрокиЖизни КАК СрокиЖизни
	                      |		ПО CRM_ОбъектыАРМ_Обращения.КаналПолучения = СрокиЖизни.Канал
	                      |ГДЕ
	                      |	РАЗНОСТЬДАТ(CRM_ОбъектыАРМ_Обращения.Дата, &ТекущаяДата, ДЕНЬ) > СрокиЖизни.CRM_СрокЖизниОбращения");
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Выборка.Объект,
			Справочники.CRM_СостоянияЛидов.Потерян,,, НСтр("ru = 'Истек срок жизни обращения.'"));
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
